Tekla Open API Reference for Tekla Structures 2025
Solid.Intersect Method
Overload List
Name | Description
Intersect(LineSegment)
 Returns a list of line - solid intersection points.
Intersect(Point, Point)
 Returns a list of line - solid intersection points.
Intersect(Point, Point, Point) |  Obsolete.
 Returns a list of plane - solid intersection points. The first item of the list contains a list of the outmost intersection polygon and the rest of the items (if there are any) inner polygons.
Top
See Also
Reference
Solid Class
Tekla.Structures.Model Namespace